In [3]:
import pandas as pd
df=pd.Series([1,2,3,3,45,6])

In [4]:
df.tolist()

[1, 2, 3, 3, 45, 6]

In [15]:
df1= pd.Series([2, 4, 6, 8, 10])
df2= pd.Series([1, 3, 8, 7, 9])

In [9]:
df1+df2

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [10]:
df1-df2

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [11]:
df1*df2

0     2
1    12
2    30
3    56
4    90
dtype: int64

In [12]:
df1/df2

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [16]:
df1<df2

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [17]:
df1>df2

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [18]:
d={'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
pd.Series(d)

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [21]:
import numpy as np

In [23]:
ar=np.array([10,20,30,40,50])
pd.Series(ar)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [25]:
s1=pd.Series([100,200,'py',330.12,400])

In [28]:
s2=pd.to_numeric(s1,errors='coerce')

In [29]:
s2

0    100.00
1    200.00
2       NaN
3    330.12
4    400.00
dtype: float64

In [31]:
s1=pd.Series([1,2,3,45,78])
a=np.array(s1.values.tolist())
a

array([ 1,  2,  3, 45, 78])

In [38]:
s = pd.Series([
    ['Red', 'Green', 'White'],
    ['Red', 'Black'],
    ['Yellow']])
print("Original Series of list")
print(s)
s=s.apply(pd.Series).stack().reset_index(drop=True)
print(s)

Original Series of list
0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object
0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [39]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
s1 = df.iloc[:,0]
print("\n1st column as a Series:")
print(s1)
print(type(s1))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

1st column as a Series:
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

In [40]:
import pandas as pd
s = pd.Series([0, 1,2,3,4,5,6,7,8,9,10])
print("Original Data Series:")
print(s)
print("\nSubset of the above Data Series:")
n = 6
new_s = s[s < n]
print(new_s)

Original Data Series:
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

Subset of the above Data Series:
0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [42]:
s=pd.Series(data=[1,2,3,34,6],index=['A', 'B', 'C','D','E'])
s=s.reindex(index=['B','A','C','D','E'])
s

B     2
A     1
C     3
D    34
E     6
dtype: int64

In [43]:
import pandas as pd
s = pd.Series(data = [1,2,3,4,5,6,7,8,9,5,3])
print("Original Data Series:")
print(s)
print("Mean of the said Data Series:")
print(s.mean())
print("Standard deviation of the said Data Series:")
print(s.std())

Original Data Series:
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int64
Mean of the said Data Series:
4.818181818181818
Standard deviation of the said Data Series:
2.522624895547565

In [45]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([2, 4, 6, 8, 10])
result=s1[~(s1.isin(s2))]

In [46]:
result

0    1
2    3
4    5
dtype: int64

In [52]:
result=s2[~(s2.isin(s1))]
result

2     6
3     8
4    10
dtype: int64

In [51]:
result=s2[~(s1.isin(s2))]
result

0     2
2     6
4    10
dtype: int64

In [53]:
s1.isin(s2)

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [54]:
s2.isin(s1)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [57]:
s2[~(s2.isin(s1))]

2     6
3     8
4    10
dtype: int64

In [56]:
s1[~(s1.isin(s2))]

0    1
2    3
4    5
dtype: int64

In [58]:
import pandas as pd
import numpy as np

In [62]:
num_state = np.random.RandomState(100)
num_series = pd.Series(num_state.normal(10, 4, 20))
print(num_series)
result = np.percentile(num_series, q=[0, 25, 50, 75, 100])
print("\nMinimum, 25th percentile, median, 75th, and maximum of a given series:")
print(result)

0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
dtype: float64

Minimum, 25th percentile, median, 75th, and maximum of a given series:
[ 3.00093811  8.09463867 10.23353705 12.21537733 14.61214321]

In [70]:
num_series = pd.Series(np.random.randint(1, 10, 9))
print("Original Series:")
result = np.where(num_series%5==0)
print("Positions of numbers that are multiples of 5:")
print(result)

Original Series:
Positions of numbers that are multiples of 5:
(array([6], dtype=int64),)

In [76]:
series1 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
series2 = pd.Series([1, 3, 5, 7, 10])
print("Original Series:")
print(series1)
print(series2)
result = [pd.Index(series1).get_loc(i) for i in series2]
print("Positions of items of series2 in series1:")
print(result)

Original Series:
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
0     1
1     3
2     5
3     7
4    10
dtype: int64
Positions of items of series2 in series1:
[0, 2, 4, 6, 9]

In [79]:
import pandas as pd
series1 = pd.Series(['php', 'python', 'java', 'c#'])
print("Original Series:")
print(series1)
result = series1.map(lambda x: x[0].upper() + x[1:-1] + x[-1].upper())
print("\nFirst and last character of each word to upper case:")
print(result)

Original Series:
0       php
1    python
2      java
3        c#
dtype: object

First and last character of each word to upper case:
0       PhP
1    PythoN
2      JavA
3        C#
dtype: object

In [81]:
series1 = pd.Series(['php', 'python', 'java', 'c#'])
print(series1)
result=series1.map(lambda x:len(x))
print(result)

0       php
1    python
2      java
3        c#
dtype: object
0    3
1    6
2    4
3    2
dtype: int64

In [85]:
series1 = pd.Series([1, 3, 5, 8, 10, 11, 15])
print("Original Series:")
print(series1)
print(series1.diff().tolist())
print(series1.diff().diff().tolist())

Original Series:
0     1
1     3
2     5
3     8
4    10
5    11
6    15
dtype: int64
[nan, 2.0, 2.0, 3.0, 2.0, 1.0, 4.0]
[nan, nan, 0.0, 1.0, -1.0, -1.0, 3.0]

In [1]:
import pandas as pd
date_series=pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
pd.to_datetime(date_series)

0   2015-01-01 00:00:00
1   2016-10-02 00:00:00
2   2018-03-07 00:00:00
3   2014-05-06 00:00:00
4   2016-04-12 00:00:00
5   2019-04-06 11:20:00
dtype: datetime64[ns]

In [4]:
from dateutil.parser import parse

In [7]:
date_series = date_series.map(lambda x: parse(x))

In [8]:
print(date_series.dt.day)

0     1
1     2
2     7
3     6
4    12
5     6
dtype: int64

In [13]:
import pandas as pd
from collections import Counter
color_series = pd.Series(['Red', 'Green', 'Orange', 'Pink', 'Yellow', 'White'])
print("Original Series:")
print(color_series)
print("\nFiltered words:")
result=color_series.map(lambda x:sum([Counter(x.lower()).get(i,0) for i in list('aeiou')])>=2)
result

Original Series:
0       Red
1     Green
2    Orange
3      Pink
4    Yellow
5     White
dtype: object

Filtered words:

0    False
1     True
2     True
3    False
4     True
5     True
dtype: bool

In [16]:
Counter('Reeeeeed'.lower()).get('e',0)

6

In [2]:
import pandas as pd
import numpy as np
x=pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
y = pd.Series([11, 8, 7, 5, 6, 5, 3, 4, 7, 1])
print("Original series:")
print(x)
print(y)
print("\nEuclidean distance between two said series:")
print(np.linalg.norm(x-y))

Original series:
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
0    11
1     8
2     7
3     5
4     6
5     5
6     3
7     4
8     7
9     1
dtype: int64

Euclidean distance between two said series:
16.492422502470642

In [10]:
import pandas as pd
str1='abc def abcdef icd'
print("Original series:")
print(list(str1))
ser=pd.Series(list(str1))
print(ser)
freq=ser.value_counts()
current_freq=freq.dropna().index[-1]
result=''.join(ser.replace(' ',current_freq))
result

Original series:
['a', 'b', 'c', ' ', 'd', 'e', 'f', ' ', 'a', 'b', 'c', 'd', 'e', 'f', ' ', 'i', 'c', 'd']
0     a
1     b
2     c
3
4     d
5     e
6     f
7
8     a
9     b
10    c
11    d
12    e
13    f
14
15    i
16    c
17    d
dtype: object

'abcidefiabcdefiicd'

In [16]:
import pandas as pd
import numpy as np
nums = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
print("Original series:")
print(nums)
print("\nPositions of the values surrounded by smaller values on both sides:")
temp = np.diff(np.sign(np.diff(nums)))
print(temp)
np.where(temp == -2)[0]+1

Original series:
0    1
1    8
2    7
3    5
4    6
5    5
6    3
7    4
8    7
9    1
dtype: int64

Positions of the values surrounded by smaller values on both sides:
[-2  0  2 -2  0  2  0 -2]

array([1, 4, 8], dtype=int64)

In [18]:
import pandas as pd
import numpy as np
nums = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
print("Original series:")
print(nums)
temp=np.diff(np.sign(np.diff(nums)))
result=np.where(temp==-2)[0]+1
print("\nPositions of the values surrounded by smaller values on both sides:")
print(result)

Original series:
0    1
1    8
2    7
3    5
4    6
5    5
6    3
7    4
8    7
9    1
dtype: int64

Positions of the values surrounded by smaller values on both sides:
[1 4 8]

In [20]:
result=pd.Series(pd.date_range('2020-01-01',periods=52, freq='W-SUN'))
print("All Sundays of 2019:")
print(result)

All Sundays of 2019:
0    2020-01-05
1    2020-01-12
2    2020-01-19
3    2020-01-26
4    2020-02-02
5    2020-02-09
6    2020-02-16
7    2020-02-23
8    2020-03-01
9    2020-03-08
10   2020-03-15
11   2020-03-22
12   2020-03-29
13   2020-04-05
14   2020-04-12
15   2020-04-19
16   2020-04-26
17   2020-05-03
18   2020-05-10
19   2020-05-17
20   2020-05-24
21   2020-05-31
22   2020-06-07
23   2020-06-14
24   2020-06-21
25   2020-06-28
26   2020-07-05
27   2020-07-12
28   2020-07-19
29   2020-07-26
30   2020-08-02
31   2020-08-09
32   2020-08-16
33   2020-08-23
34   2020-08-30
35   2020-09-06
36   2020-09-13
37   2020-09-20
38   2020-09-27
39   2020-10-04
40   2020-10-11
41   2020-10-18
42   2020-10-25
43   2020-11-01
44   2020-11-08
45   2020-11-15
46   2020-11-22
47   2020-11-29
48   2020-12-06
49   2020-12-13
50   2020-12-20
51   2020-12-27
dtype: datetime64[ns]

In [21]:
import numpy as np
import pandas as pd
char_list = list('ABCDEFGHIJKLMNOP')
num_arra=np.arange(8)
num_dict=dict(zip(char_list,num_arra))
num_series=pd.Series(num_dict)
df=num_series.to_frame().reset_index()
df.head()

  index  0
0     A  0
1     B  1
2     C  2
3     D  3
4     E  4

In [22]:
series1=pd.Series(range(10))
series2=pd.Series(list('pqrstuvwxy'))
series1.append(series2)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
0    p
1    q
2    r
3    s
4    t
5    u
6    v
7    w
8    x
9    y
dtype: object

In [24]:
df=pd.concat([series1,series2], axis=1)
df

   0  1
0  0  p
1  1  q
2  2  r
3  3  s
4  4  t
5  5  u
6  6  v
7  7  w
8  8  x
9  9  y

In [26]:
ser=pd.Series([1,45,78,2,90,6677,2,4])
print(ser.idxmin())
print(ser.idxmax())

0
5

In [27]:
df_data = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,75,None,80,86], 'Y':[84,94,89,86,86],'Z':[86,97,96,72,83]})
sr_data = pd.Series([68, 75, 86, 80, None]) 
print("Original DataFrame:")
print(df_data)
print("\nOriginal Series:")
print(sr_data)
print("\nCheck for inequality of the said series & dataframe:")
print(df_data.ne(sr_data, axis = 0))

Original DataFrame:
      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  75.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  86  72
4   NaN  86.0  86  83

Original Series:
0    68.0
1    75.0
2    86.0
3    80.0
4     NaN
dtype: float64

Check for inequality of the said series & dataframe:
       W      X     Y     Z
0  False   True  True  True
1  False  False  True  True
2  False   True  True  True
3  False  False  True  True
4   True   True  True  True

# DataFrames

In [7]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

In [3]:
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

Sample DataFrame:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [8]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [10]:
df=pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

Write a Pandas program to get the first 3 rows of a given DataFrame.

In [12]:
df.iloc[0:3,:]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [13]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Write a Pandas program to select the specified columns and rows from a given DataFrame.
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [14]:
df.iloc[[1,3,5,6],[1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

Pandas DataFrame: Select the rows where the number of attempts in the examination is greater than 2

In [16]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Write a Pandas program to count the number of rows and columns of a DataFrame.

In [21]:
rows=df.axes[0]
cols=df.axes[1]
print('no. of rows:',len(rows))
print('no. of columns:',len(cols))

no. of rows: 10
no. of columns: 4

Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [23]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

Write a Pandas program to select the rows where the score is between 15 and 20.

In [24]:
df[df['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Write a Pandas program to change the score in row 'd' to 11.5.

In [26]:
df.loc['d','score']=11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to calculate the sum of the examination attempts by the students.

In [27]:
df['attempts'].sum()

19

Write a Pandas program to calculate the mean score for each different student in data frame.

In [29]:
df['score'].mean()

13.333333333333334

Write a Pandas program to append a new row 'k' to DataFrame with given values for each column. Now delete the new row and return the original data frame.

In [31]:
df.loc['k']=[1, 'Suresh', 'yes', 15.5]
df

        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima       9        3      no
c  Katherine    16.5        2     yes
d      James    11.5        3      no
e      Emily       9        2      no
f    Michael      20        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin       8        2      no
j      Jonas      19        1     yes
k          1  Suresh      yes    15.5

In [35]:
df.drop('k',axis=0,inplace=True)

Write a Pandas program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

In [36]:
df.sort_values(['name','score'],ascending=[False,True])

        name score attempts qualify
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
c  Katherine  16.5        2     yes
j      Jonas    19        1     yes
d      James  11.5        3      no
e      Emily     9        2      no
b       Dima     9        3      no
a  Anastasia  12.5        1     yes

Write a Pandas program to replace the qualify' column contains the values 'yes' and 'no' with True and False.

In [38]:
df['qualify']=df['qualify'].map({'yes':1,'no':0})

In [39]:
df

        name score attempts  qualify
a  Anastasia  12.5        1        1
b       Dima     9        3        0
c  Katherine  16.5        2        1
d      James  11.5        3        0
e      Emily     9        2        0
f    Michael    20        3        1
g    Matthew  14.5        1        1
h      Laura   NaN        1        0
i      Kevin     8        2        0
j      Jonas    19        1        1

Write a Pandas program to change the name 'James' to 'Suresh' in name column of the data frame.

In [42]:
df['name']=df['name'].replace('James','Suresh')

In [43]:
df

        name score attempts  qualify
a  Anastasia  12.5        1        1
b       Dima     9        3        0
c  Katherine  16.5        2        1
d     Suresh  11.5        3        0
e      Emily     9        2        0
f    Michael    20        3        1
g    Matthew  14.5        1        1
h      Laura   NaN        1        0
i      Kevin     8        2        0
j      Jonas    19        1        1

Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [45]:
df.drop('attempts',axis=1)

        name score  qualify
a  Anastasia  12.5        1
b       Dima     9        0
c  Katherine  16.5        1
d     Suresh  11.5        0
e      Emily     9        0
f    Michael    20        1
g    Matthew  14.5        1
h      Laura   NaN        0
i      Kevin     8        0
j      Jonas    19        1

Write a Pandas program to insert a new column in existing DataFrame.

In [46]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
df

        name score attempts  qualify   color
a  Anastasia  12.5        1        1     Red
b       Dima     9        3        0    Blue
c  Katherine  16.5        2        1  Orange
d     Suresh  11.5        3        0     Red
e      Emily     9        2        0   White
f    Michael    20        3        1   White
g    Matthew  14.5        1        1    Blue
h      Laura   NaN        1        0   Green
i      Kevin     8        2        0   Green
j      Jonas    19        1        1     Red

Write a Pandas program to iterate over rows in a DataFrame.

Sample Python dictionary data and list labels:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]

In [48]:
df=pd.DataFrame([{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}])
df

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5

In [57]:
for index,rows in df.iterrows():
    #print(rows['name'],rows['score'])
    print((rows))

name     Anastasia
score         12.5
Name: 0, dtype: object
name     Dima
score       9
Name: 1, dtype: object
name     Katherine
score         16.5
Name: 2, dtype: object

Write a Pandas program to get list from DataFrame column headers.

In [59]:
df.columns.values

array(['name', 'score'], dtype=object)

In [60]:
import pandas as pd
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

Write a Pandas program to change the order of a DataFrame columns.

In [63]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [64]:
df=df[['col2','col1','col3']]

In [65]:
df

   col2  col1  col3
0     4     1     7
1     5     2     8
2     6     3     9

Write a Pandas program to add one row in an existing DataFrame.

In [66]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df2 = {'col1': 10, 'col2': 11, 'col3': 12}
df.append(df2,ignore_index=True)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [67]:
df.to_csv('new_file.csv',sep='\t',index=False)

Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [69]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

In [73]:
df1.groupby(['city']).size().reset_index(name='Number of people')

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

#Delete DataFrame row(s) based on given column value

In [74]:
df[df['col2']!=5]

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

Widen output display to see more columns

In [76]:
pd.set_option('display.max_rows',500)
pd.set_option('display.max_columns',500)
pd.set_option('display.width',10000)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Write a Pandas program to select a row of series/dataframe by given integer index.

In [78]:
df.iloc[2:3,:]

   col1  col2  col3
2     3     6     9

In [83]:
df.iloc[[2]]

   col1  col2  col3
2     3     6     9

Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [84]:
df.fillna(0)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Write a Pandas program to convert index in a column of the given dataframe.

In [87]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
print("\nAfter converting index in a column:")
df.reset_index(level=0, inplace=True)
print(df)
print("\nHiding index:")
print( df.to_string(index=False))

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

After converting index in a column:
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

Hiding index:
 index       name  score  attempts qualify
     0  Anastasia   12.5         1     yes
     1       Dima    9.0         3      no
     2  Katherine   16.5         2     yes
     3      James    NaN         3      no
     4      Emily    9.0         2      no
     5    Michael   20.0         3     yes
     6    Matthew   14.5         1     yes
     7      Laura    NaN         1      no
     8      Kevin    8.0         2      no
     9      Jonas   19.0         1     yes

Write a Pandas program to set a given value for particular cell in DataFrame using index value.

In [90]:
df.loc[8,'attempts']=4

In [91]:
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         4      no
9      9      Jonas   19.0         1     yes

Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [93]:
df.isnull().values.sum()

2

Write a Pandas program to drop a list of rows from a specified DataFrame.

In [94]:
df.drop([1,3],axis=0)

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
2      2  Katherine   16.5         2     yes
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         4      no
9      9      Jonas   19.0         1     yes

In [96]:
df.drop(df.index[[1,3]],axis=0)

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
2      2  Katherine   16.5         2     yes
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         4      no
9      9      Jonas   19.0         1     yes

Write a Pandas program to reset index in a given DataFrame.

In [132]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [133]:
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [120]:
df.drop(df.index[[1,3]],axis=0,inplace=True)
df=df.reset_index(drop=True)

In [121]:
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1  Katherine   16.5         2     yes
2      Emily    9.0         2      no
3    Michael   20.0         3     yes
4    Matthew   14.5         1     yes
5      Laura    NaN         1      no
6      Kevin    8.0         2      no
7      Jonas   19.0         1     yes

Write a Pandas program to divide a DataFrame in a given ratio.

In [122]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 2))
print("Original DataFrame:")
print(df)

Original DataFrame:
          0         1
0 -0.133361 -0.309281
1  0.391875 -0.948452
2  1.349395 -1.543400
3 -0.041867  0.597130
4  0.412111 -0.283967
5  0.207176 -0.478848
6 -0.220373  0.253931
7 -0.196308  0.110803
8 -0.230088 -1.875713
9 -0.597937 -2.370160

In [125]:
part_70 =df.sample(frac=0.70,random_state=9)
part_30=df.drop(part_70.index)

In [126]:
part_70

          0         1
8 -0.230088 -1.875713
4  0.412111 -0.283967
7 -0.196308  0.110803
2  1.349395 -1.543400
1  0.391875 -0.948452
9 -0.597937 -2.370160
3 -0.041867  0.597130

In [127]:
part_30

          0         1
0 -0.133361 -0.309281
5  0.207176 -0.478848
6 -0.220373  0.253931

Write a Pandas program to combining two series into a DataFrame.

In [128]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
df=pd.concat([s1,s2],axis=1)

In [129]:
df

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

Write a Pandas program to shuffle a given DataFrame rows.

In [134]:
df=df.sample(frac=1)

In [135]:
df

        name  score  attempts qualify
6    Matthew   14.5         1     yes
5    Michael   20.0         3     yes
3      James    NaN         3      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
7      Laura    NaN         1      no
1       Dima    9.0         3      no
9      Jonas   19.0         1     yes
8      Kevin    8.0         2      no
0  Anastasia   12.5         1     yes

In [136]:
s=pd.Series(['2/11/2020','1/2/2011','4/9/2005'])

In [140]:
r=pd.to_datetime(s)

In [141]:
df=pd.DataFrame(r)

In [142]:
df

           0
0 2020-02-11
1 2011-01-02
2 2005-04-09

Write a Pandas program to get a list of a specified column of a DataFrame.

In [143]:
import pandas as pd
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [144]:
col_list=df['col2'].tolist()

In [145]:
col_list

[4, 5, 6]

Write a Pandas program to find the row for where the value of a given column is maximum.

In [146]:
df['col1'].argmax()

2

Write a Pandas program to check whether a given column is present in a DataFrame or not.

In [154]:
if('col1' in df.columns):
    print('The given column is present')
else:
    print('The given column is not present')

The given column is present

Write a Pandas program to get the specified row value of a given DataFrame.

In [155]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("Value of Row1")
print(df.iloc[0])
print("Value of Row4")
print(df.iloc[3])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Value of Row1
col1    1
col2    4
col3    7
Name: 0, dtype: int64
Value of Row4
col1    4
col2    9
col3    1
Name: 3, dtype: int64

Get the datatypes of columns of a DataFrame

In [156]:
df.dtypes

col1    int64
col2    int64
col3    int64
dtype: object

Write a Pandas program to append data to an empty DataFrame.

In [160]:
df=pd.DataFrame()
df1=pd.DataFrame({'col1':[1,2,3],'col2':[3,4,5]})
df=df.append(df1)
df

   col1  col2
0     1     3
1     2     4
2     3     5

Write a Pandas program to sort a given DataFrame by two or more columns.

In [161]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame:")
print(df)
print("\nSort the above DataFrame on attempts, name:")
df=df.sort_values(['attempts','qualify'],ascending=[True,True])
df

Original DataFrame:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Sort the above DataFrame on attempts, name:

        name  score  attempts qualify
7      Laura    NaN         1      no
0  Anastasia   12.5         1     yes
6    Matthew   14.5         1     yes
9      Jonas   19.0         1     yes
4      Emily    9.0         2      no
8      Kevin    8.0         2      no
2  Katherine   16.5         2     yes
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

Write a Pandas program to convert the datatype of a given column(floats to ints).

In [164]:
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [167]:
df.attempts = df.attempts.astype(int)

In [168]:
df.dtypes

name         object
score       float64
attempts      int32
qualify      object
dtype: object

Write a Pandas program to remove infinite values from a given DataFrame.

In [169]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])

In [170]:
df=df.replace([np.inf, -np.inf],0)
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     0.0
5     0.0

Write a Pandas program to insert a given column at a specific column index in a DataFrame.

In [181]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

Original DataFrame
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [182]:
df.insert(loc=0,value=[1,3,55,6,89],column='col1')

In [183]:
df

   col1  col2  col3
0     1     4     7
1     3     5     8
2    55     6    12
3     6     9     1
4    89     5    11

Write a Pandas program to convert a given list of lists into a Dataframe.

In [184]:
my__lists=[['col1','col2'],[1,2],[3,5]]

In [185]:
header=my__lists.pop(0)

In [189]:
df=pd.DataFrame(my__lists,columns=header)

In [190]:
df

   col1  col2
0     1     2
1     3     5

Write a Pandas program to group by the first column and get second column as lists in rows.

In [195]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
print(df)

Original DataFrame
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [197]:
df.groupby(['col1'])['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

Write a Pandas program to get column index from column name of a given DataFrame.

In [199]:
df.columns.get_loc('col2')

1

Write a Pandas program to count number of columns of a DataFrame.

In [201]:
len(df.columns)

2

Write a Pandas program to select all columns, except one given column in a DataFrame.

In [206]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [207]:
df=df.loc[:,df.columns!='col2']

In [208]:
df

   col1  col3
0     1     7
1     2     8
2     3    12
3     4     1
4     7    11

Write a Pandas program to get first n records of a DataFrame.

In [209]:
df.head(3)

   col1  col3
0     1     7
1     2     8
2     3    12

Write a Pandas program to get last n records of a DataFrame.

In [211]:
df.tail(3)

   col1  col3
2     3    12
3     4     1
4     7    11

Write a Pandas program to get topmost n records within each group of a DataFrame.

In [212]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\ntopmost n records within each group of a DataFrame:")

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

topmost n records within each group of a DataFrame:

In [214]:
df.nlargest(3,'col1')

   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12

In [216]:
df.nlargest(3,'col2')

   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5

In [217]:
df.nlargest(3,'col3')

   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

Write a Pandas program to remove first n rows of a given DataFrame.

In [219]:
df.iloc[3:,]

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [220]:
df.add_prefix('A_')

   A_col1  A_col2  A_col3
0       1       4       7
1       2       5       5
2       3       6       8
3       4       9      12
4       7       5       1
5      11       0      11

In [223]:
df.add_suffix('_D')

   col1_D  col2_D  col3_D
0       1       4       7
1       2       5       5
2       3       6       8
3       4       9      12
4       7       5       1
5      11       0      11

Write a Pandas program to select columns by data type of a given DataFrame

In [226]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)
print(df.dtypes)
print("\nSelect numerical columns")
df.select_dtypes(include='number')

Original DataFrame
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0
name              object
date_of_birth     object
age              float64
dtype: object

Select numerical columns

    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

In [228]:
df.select_dtypes(include = "object")

             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

Write a Pandas program to rename all columns with the same pattern of a given DataFrame.

In [231]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)
df.columns=df.columns.str.lower().str.rstrip()
print(df)

Original DataFrame
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

# Index

  Write a Pandas program to display the default index and set a column as an Index in a given dataframe.  Write a Pandas program to display the default index and set a column as an Index in a given dataframe.

In [232]:
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
print("Default Index:")
print(df.head(10))

Default Index:
  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [234]:
df.set_index('school_code')

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

Create a multi Index frame using two columns and using an Index and a column

In [235]:
df.set_index(['school_code','name'])

                           class date_Of_Birth  weight  address t_id
school_code name
s001        Alberto Franco     V    15/05/2002      35  street1   t1
s002        Gino Mcneill       V    17/05/2002      32  street2   t2
s003        Ryan Parkes       VI    16/02/1999      33  street3   t3
s001        Eesha Hinton      VI    25/09/1998      30  street1   t4
s002        Gino Mcneill       V    11/05/2002      31  street2   t5
s004        David Parkes      VI    15/09/1997      32  street4   t6

Write a Pandas program to display the default index and set a column as an Index in a given dataframe and then reset the index.

In [236]:
df1=df.set_index(['school_code','name'])

In [238]:
df1=df1.reset_index()
df1

  school_code            name class date_Of_Birth  weight  address t_id
0        s001  Alberto Franco     V    15/05/2002      35  street1   t1
1        s002    Gino Mcneill     V    17/05/2002      32  street2   t2
2        s003     Ryan Parkes    VI    16/02/1999      33  street3   t3
3        s001    Eesha Hinton    VI    25/09/1998      30  street1   t4
4        s002    Gino Mcneill     V    11/05/2002      31  street2   t5
5        s004    David Parkes    VI    15/09/1997      32  street4   t6

Write a Pandas program to create a dataframe indexing by date and time.

In [243]:
dt_range=pd.date_range(start='05/12/2020',freq='S',periods=10)
df_dt=pd.DataFrame({"Sale_amt":[100, 110, 117, 150, 112, 99, 129, 135, 140, 150]},
                            index = dt_range)
df_dt

                     Sale_amt
2020-05-12 00:00:00       100
2020-05-12 00:00:01       110
2020-05-12 00:00:02       117
2020-05-12 00:00:03       150
2020-05-12 00:00:04       112
2020-05-12 00:00:05        99
2020-05-12 00:00:06       129
2020-05-12 00:00:07       135
2020-05-12 00:00:08       140
2020-05-12 00:00:09       150

Write a Pandas program to create a dataframe and set a title or name of the index column

In [244]:
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
                                index = ['t1', 't2', 't3', 't4', 't5', 't6'])
print("Original DataFrame:")
print(df)

Original DataFrame:
   school_code class            name date_Of_Birth  weight  address
t1        s001     V  Alberto Franco    15/05/2002      35  street1
t2        s002     V    Gino Mcneill    17/05/2002      32  street2
t3        s003    VI     Ryan Parkes    16/02/1999      33  street3
t4        s001    VI    Eesha Hinton    25/09/1998      30  street1
t5        s002     V    Gino Mcneill    11/05/2002      31  street2
t6        s004    VI    David Parkes    15/09/1997      32  street4

In [245]:
df.index.name='IndexName'

In [246]:
df

          school_code class            name date_Of_Birth  weight  address
IndexName
t1               s001     V  Alberto Franco    15/05/2002      35  street1
t2               s002     V    Gino Mcneill    17/05/2002      32  street2
t3               s003    VI     Ryan Parkes    16/02/1999      33  street3
t4               s001    VI    Eesha Hinton    25/09/1998      30  street1
t5               s002     V    Gino Mcneill    11/05/2002      31  street2
t6               s004    VI    David Parkes    15/09/1997      32  street4

Write a Pandas program to convert index of a given dataframe into a column

In [247]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
print("Original DataFrame:")
print(df)
print("\nConvert index of the said dataframe into a column:")

Original DataFrame:
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

Convert index of the said dataframe into a column:

In [248]:
df.reset_index(level=0,inplace=True)

In [249]:
df

  index school_code class            name date_of_birth  weight
0    t1        s001     V  Alberto Franco    15/05/2002      35
1    t2        s002     V    Gino Mcneill    17/05/2002      32
2    t3        s003    VI     Ryan Parkes    16/02/1999      33
3    t4        s001    VI    Eesha Hinton    25/09/1998      30
4    t5        s002     V    Gino Mcneill    11/05/2002      31
5    t6        s004    VI    David Parkes    15/09/1997      32

Write a Pandas program to convert 1st and 3rd levels in the index into columns from a multiple level of index frame of a given dataframe.

In [250]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
print("Original DataFrame:")
print(df)
print("\nMultiIndex using columns 't_id', school_code and 'class':")
df=df.set_index(['name','weight'])
df

Original DataFrame:
  school_code class            name date_of_birth  weight t_id
0        s001     V  Alberto Franco    15/05/2002      35   t1
1        s002     V    Gino Mcneill    17/05/2002      32   t2
2        s003    VI     Ryan Parkes    16/02/1999      33   t3
3        s001    VI    Eesha Hinton    25/09/1998      30   t4
4        s002     V    Gino Mcneill    11/05/2002      31   t5
5        s004    VI    David Parkes    15/09/1997      32   t6

MultiIndex using columns 't_id', school_code and 'class':

                      school_code class date_of_birth t_id
name           weight
Alberto Franco 35            s001     V    15/05/2002   t1
Gino Mcneill   32            s002     V    17/05/2002   t2
Ryan Parkes    33            s003    VI    16/02/1999   t3
Eesha Hinton   30            s001    VI    25/09/1998   t4
Gino Mcneill   31            s002     V    11/05/2002   t5
David Parkes   32            s004    VI    15/09/1997   t6

In [251]:
df.reset_index(level=['name','weight'])

             name  weight school_code class date_of_birth t_id
0  Alberto Franco      35        s001     V    15/05/2002   t1
1    Gino Mcneill      32        s002     V    17/05/2002   t2
2     Ryan Parkes      33        s003    VI    16/02/1999   t3
3    Eesha Hinton      30        s001    VI    25/09/1998   t4
4    Gino Mcneill      31        s002     V    11/05/2002   t5
5    David Parkes      32        s004    VI    15/09/1997   t6

Write a Pandas program to check if a specified value exists in single and multiple column index dataframe.

In [252]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})

In [258]:
df1 = df.set_index(['t_id', 'school_code', 'class'])
df1

                                  name date_of_birth  weight
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35
t2   s002        V        Gino Mcneill    17/05/2002      32
t3   s003        VI        Ryan Parkes    16/02/1999      33
t4   s001        VI       Eesha Hinton    25/09/1998      30
t5   s002        V        Gino Mcneill    11/05/2002      31
t6   s004        VI       David Parkes    15/09/1997      32

In [260]:
't1' in df1.index.levels[0]

True

In [261]:
't1' in df1.index.levels[1]

False

In [262]:
't1' in df1.index.levels[2]

False

Write a Pandas program to construct a DataFrame using the MultiIndex levels as the column and index.

In [266]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
print("Create a MultiIndex:")
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)

Create a MultiIndex:
[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

In [273]:
sales_tuples = list(zip(*sales_arrays))

In [274]:
sales_tuples

[('sale1', 'city1'),
 ('sale1', 'city2'),
 ('sale2', 'city1'),
 ('sale2', 'city2'),
 ('sale3', 'city1'),
 ('sale3', 'city2'),
 ('sale4', 'city1'),
 ('sale4', 'city2')]

In [275]:
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

                    0         1         2         3         4
sale  city
sale1 city1  1.198537  0.428317 -0.453785  1.899315 -0.384605
      city2 -0.833656 -0.200935  0.745193 -1.629200 -0.383171
sale2 city1 -0.706702 -0.430878  0.932568  0.053671 -2.165432
      city2 -0.725745  1.131010 -2.429548  1.007330  0.495352
sale3 city1  1.680418  0.111393 -0.756431  0.068144  0.462143
      city2 -0.076683 -0.092731 -0.761197 -3.156465 -1.121585
sale4 city1  1.029366  0.403830  1.829956  1.256511  0.247208
      city2  0.333415 -0.087802  1.806654  1.026059  1.959445

In [279]:
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
df

                    0         1         2         3         4
sale  city
sale1 city1  1.216675  0.134195  1.596349  0.521307 -1.568259
      city2 -0.756787 -1.146444 -0.973454 -0.007532  0.216408
sale2 city1 -0.205235  1.003038 -1.217733 -0.161854 -0.582616
      city2 -0.176744  1.690961 -0.132085  1.358952  0.126418
sale3 city1 -0.188678 -2.660389 -1.989663  0.081795  2.039204
      city2  0.593278 -0.276563 -0.352399 -0.895244 -0.272188
sale4 city1  0.732511  0.773679 -0.507404 -0.462018 -0.737259
      city2 -0.492720  0.374101  1.293167 -0.321544  0.326780

Write a Pandas program to extract a single row, rows and a specific value from a MultiIndex levels DataFrame.

In [281]:
df.loc[('sale2','city1')]

0   -0.205235
1    1.003038
2   -1.217733
3   -0.161854
4   -0.582616
Name: (sale2, city1), dtype: float64

Write a Pandas program to rename names of columns and specific labels of the Main Index of the MultiIndex dataframe.

In [283]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)
print("\nRename the columns name of the said dataframe")
df1 = df.rename(columns={0: "col1", 1: "col2", 2:"col3", 3:"col4", 4:"col5"})
df2=df1.rename(index={'sale2':'s2'})
df2

[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1  0.499207  0.997437  1.988447  0.265657  0.342376
      city2 -1.007930  0.704378  1.504829  0.338424 -0.215848
sale2 city1  2.165991  1.383055 -0.162758  0.606777  0.752068
      city2  0.131491  0.982560  0.577041 -0.307310 -0.045245
sale3 city1 -1.043705  1.757563 -0.406415  1.062744 -0.224873
      city2 -0.681995 -0.674158 -1.020625  1.238802 -0.026789
sale4 city1 -0.774492  2.134158  1.702795  0.871801  1.150763
      city2 -0.155128  0.779098  0.832661  0.306302 -2.147372

Rename the columns name of the said dataframe

                 col1      col2      col3      col4      col5
sale  city
sale1 city1  0.499207  0.997437  1.988447  0.265657  0.342376
      city2 -1.007930  0.704378  1.504829  0.338424 -0.215848
s2    city1  2.165991  1.383055 -0.162758  0.606777  0.752068
      city2  0.131491  0.982560  0.577041 -0.307310 -0.045245
sale3 city1 -1.043705  1.757563 -0.406415  1.062744 -0.224873
      city2 -0.681995 -0.674158 -1.020625  1.238802 -0.026789
sale4 city1 -0.774492  2.134158  1.702795  0.871801  1.150763
      city2 -0.155128  0.779098  0.832661  0.306302 -2.147372

Write a Pandas program to sort a MultiIndex of a DataFrame. Also sort on various levels of index.

In [284]:
df.sort_index(level=0)

                    0         1         2         3         4
sale  city
sale1 city1  0.499207  0.997437  1.988447  0.265657  0.342376
      city2 -1.007930  0.704378  1.504829  0.338424 -0.215848
sale2 city1  2.165991  1.383055 -0.162758  0.606777  0.752068
      city2  0.131491  0.982560  0.577041 -0.307310 -0.045245
sale3 city1 -1.043705  1.757563 -0.406415  1.062744 -0.224873
      city2 -0.681995 -0.674158 -1.020625  1.238802 -0.026789
sale4 city1 -0.774492  2.134158  1.702795  0.871801  1.150763
      city2 -0.155128  0.779098  0.832661  0.306302 -2.147372

In [285]:
df.sort_index(level=1)

                    0         1         2         3         4
sale  city
sale1 city1  0.499207  0.997437  1.988447  0.265657  0.342376
sale2 city1  2.165991  1.383055 -0.162758  0.606777  0.752068
sale3 city1 -1.043705  1.757563 -0.406415  1.062744 -0.224873
sale4 city1 -0.774492  2.134158  1.702795  0.871801  1.150763
sale1 city2 -1.007930  0.704378  1.504829  0.338424 -0.215848
sale2 city2  0.131491  0.982560  0.577041 -0.307310 -0.045245
sale3 city2 -0.681995 -0.674158 -1.020625  1.238802 -0.026789
sale4 city2 -0.155128  0.779098  0.832661  0.306302 -2.147372

In [286]:
df.sort_index(level='city')

                    0         1         2         3         4
sale  city
sale1 city1  0.499207  0.997437  1.988447  0.265657  0.342376
sale2 city1  2.165991  1.383055 -0.162758  0.606777  0.752068
sale3 city1 -1.043705  1.757563 -0.406415  1.062744 -0.224873
sale4 city1 -0.774492  2.134158  1.702795  0.871801  1.150763
sale1 city2 -1.007930  0.704378  1.504829  0.338424 -0.215848
sale2 city2  0.131491  0.982560  0.577041 -0.307310 -0.045245
sale3 city2 -0.681995 -0.674158 -1.020625  1.238802 -0.026789
sale4 city2 -0.155128  0.779098  0.832661  0.306302 -2.147372

In [290]:
df.iloc[:,3:]

                    3         4
sale  city
sale1 city1  0.265657  0.342376
      city2  0.338424 -0.215848
sale2 city1  0.606777  0.752068
      city2 -0.307310 -0.045245
sale3 city1  1.062744 -0.224873
      city2  1.238802 -0.026789
sale4 city1  0.871801  1.150763
      city2  0.306302 -2.147372

Write a Pandas program to get the index of an element of a given Series.

In [295]:
ds = pd.Series([1,3,5,7,9,11,13,15], index=[0,1,2,3,4,5,7,8])
ds[ds==11].index[0]

5

In [297]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
print("Original DataFrame with single index:")
print(df)
df.index[df['school_code']=='s001'].tolist()

Original DataFrame with single index:
  school_code class            name date_of_birth  weight
1        s001     V  Alberto Franco    15/05/2002      35
2        s002     V    Gino Mcneill    17/05/2002      32
3        s003    VI     Ryan Parkes    16/02/1999      33
4        s001    VI    Eesha Hinton    25/09/1998      30
5        s002     V    Gino Mcneill    11/05/2002      31
6        s004    VI    David Parkes    15/09/1997      32

[1, 4]

Drop a level from a multi-level column index

In [298]:
import pandas as pd
cols = pd.MultiIndex.from_tuples([("a", "x"), ("a", "y"), ("a", "z")])
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
print(df)
#Levels are 0-indexed beginning from the top.
print("\nRemove the top level index:")
df.columns = df.columns.droplevel(0)
print(df)
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
print("\nOriginal dataframe:")
print(df)
print("\nRemove the index next to top level:")
df.columns = df.columns.droplevel(1)
print(df)

Construct a Dataframe using the said MultiIndex levels:
   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

Remove the top level index:
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

Original dataframe:
   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

Remove the index next to top level:
   a  a  a
0  1  2  3
1  3  4  5
2  5  6  7

Write a Pandas program to print a DataFrame without index.

In [299]:
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
print("Original DataFrame with single index:")
print(df)
print("\nDataFrame without index:")
print(df.to_string(index=False))

Original DataFrame with single index:
  school_code class            name date_of_birth  weight
1        s001     V  Alberto Franco    15/05/2002      35
2        s002     V    Gino Mcneill    17/05/2002      32
3        s003    VI     Ryan Parkes    16/02/1999      33
4        s001    VI    Eesha Hinton    25/09/1998      30
5        s002     V    Gino Mcneill    11/05/2002      31
6        s004    VI    David Parkes    15/09/1997      32

DataFrame without index:
school_code class            name date_of_birth  weight
       s001     V  Alberto Franco    15/05/2002      35
       s002     V    Gino Mcneill    17/05/2002      32
       s003    VI     Ryan Parkes    16/02/1999      33
       s001    VI    Eesha Hinton    25/09/1998      30
       s002     V    Gino Mcneill    11/05/2002      31
       s004    VI    David Parkes    15/09/1997      32

Write a Pandas program to start index with different value rather than 0 in a given DataFrame.

In [300]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 37, 33, 30, 31, 32]})
     
print("Original DataFrame:")
print(df)
print("\nDefault Index Range:")
print(df.index)
df.index += 10 
print("\nNew Index Range:")
print(df.index)
print("\nDataFrame with new index:")
print(df)

Original DataFrame:
  school_code class            name date_of_birth  weight
0        s001     V  Alberto Franco    15/05/2002      35
1        s002     V    Gino Mcneill    17/05/2002      37
2        s003    VI     Ryan Parkes    16/02/1999      33
3        s001    VI    Eesha Hinton    25/09/1998      30
4        s002     V    Gino Mcneill    11/05/2002      31
5        s004    VI    David Parkes    15/09/1997      32

Default Index Range:
RangeIndex(start=0, stop=6, step=1)

New Index Range:
RangeIndex(start=10, stop=16, step=1)

DataFrame with new index:
   school_code class            name date_of_birth  weight
10        s001     V  Alberto Franco    15/05/2002      35
11        s002     V    Gino Mcneill    17/05/2002      37
12        s003    VI     Ryan Parkes    16/02/1999      33
13        s001    VI    Eesha Hinton    25/09/1998      30
14        s002     V    Gino Mcneill    11/05/2002      31
15        s004    VI    David Parkes    15/09/1997      32

Select rows from multi-index dataframe

In [301]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 37, 33, 30, 31, 32],
    'tcode': ['t1', 't2', 't3', 't4', 't5', 't6']})    
print("Original DataFrame:")
print(df)
print("\nCreate MultiIndex on 'tcode' and 'school_code':")
df = df.set_index(['tcode', 'school_code'])
print(df)

Original DataFrame:
  school_code class            name date_of_birth  weight tcode
0        s001     V  Alberto Franco    15/05/2002      35    t1
1        s002     V    Gino Mcneill    17/05/2002      37    t2
2        s003    VI     Ryan Parkes    16/02/1999      33    t3
3        s001    VI    Eesha Hinton    25/09/1998      30    t4
4        s002     V    Gino Mcneill    11/05/2002      31    t5
5        s004    VI    David Parkes    15/09/1997      32    t6

Create MultiIndex on 'tcode' and 'school_code':
                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t2    s002            V    Gino Mcneill    17/05/2002      37
t3    s003           VI     Ryan Parkes    16/02/1999      33
t4    s001           VI    Eesha Hinton    25/09/1998      30
t5    s002            V    Gino Mcneill    11/05/2002      31
t6    s004           VI    David Parkes    15/09/1997      32

In [302]:
df.query(("tcode == 't1'") and ("school_code == 's001'"))

                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t4    s001           VI    Eesha Hinton    25/09/1998      30